------------------------------------------------------------------------------
  Layer (type)         Input Shape          Output Shape         Param #
==============================================================================
    Conv3D-1      [[1, 1, 32, 32, 32]]   [1, 8, 32, 32, 32]        216
   LeakyReLU-1     [[1, 64, 4, 4, 4]]     [1, 64, 4, 4, 4]          0
    Conv3D-2      [[1, 8, 32, 32, 32]]   [1, 8, 32, 32, 32]       1,728
   Dropout3D-1     [[1, 128, 2, 2, 2]]   [1, 128, 2, 2, 2]          0
   LeakyReLU-2    [[1, 8, 32, 32, 32]]   [1, 8, 32, 32, 32]         0
    Conv3D-3      [[1, 8, 32, 32, 32]]   [1, 8, 32, 32, 32]       1,728
InstanceNorm3D-1  [[1, 8, 32, 32, 32]]   [1, 8, 32, 32, 32]        16
    Conv3D-4      [[1, 8, 32, 32, 32]]  [1, 16, 16, 16, 16]       3,456
InstanceNorm3D-2  [[1, 16, 16, 16, 16]] [1, 16, 16, 16, 16]        32
   LeakyReLU-3    [[1, 16, 16, 16, 16]] [1, 16, 16, 16, 16]         0
    Conv3D-5      [[1, 16, 16, 16, 16]] [1, 16, 16, 16, 16]       6,912
InstanceNorm3D-3  [[1, 16, 16, 16, 16]] [1, 16, 16, 16, 16]        32
    Conv3D-6      [[1, 16, 16, 16, 16]]   [1, 32, 8, 8, 8]       13,824
InstanceNorm3D-4   [[1, 32, 8, 8, 8]]     [1, 32, 8, 8, 8]         64
   LeakyReLU-4     [[1, 32, 8, 8, 8]]     [1, 32, 8, 8, 8]          0
    Conv3D-7       [[1, 32, 8, 8, 8]]     [1, 32, 8, 8, 8]       27,648
InstanceNorm3D-5   [[1, 32, 8, 8, 8]]     [1, 32, 8, 8, 8]         64
    Conv3D-8       [[1, 32, 8, 8, 8]]     [1, 64, 4, 4, 4]       55,296
InstanceNorm3D-6   [[1, 64, 4, 4, 4]]     [1, 64, 4, 4, 4]         128
   LeakyReLU-5     [[1, 64, 4, 4, 4]]     [1, 64, 4, 4, 4]          0
    Conv3D-9       [[1, 64, 4, 4, 4]]     [1, 64, 4, 4, 4]       110,592
InstanceNorm3D-7   [[1, 64, 4, 4, 4]]     [1, 64, 4, 4, 4]         128
    Conv3D-10      [[1, 64, 4, 4, 4]]    [1, 128, 2, 2, 2]       221,184
InstanceNorm3D-8   [[1, 128, 2, 2, 2]]   [1, 128, 2, 2, 2]         256
   LeakyReLU-6     [[1, 128, 2, 2, 2]]   [1, 128, 2, 2, 2]          0
    Conv3D-11      [[1, 128, 2, 2, 2]]   [1, 128, 2, 2, 2]       442,368
InstanceNorm3D-9   [[1, 128, 2, 2, 2]]   [1, 128, 2, 2, 2]         256
   LeakyReLU-7     [[1, 128, 2, 2, 2]]   [1, 128, 2, 2, 2]          0
   Upsample-2      [[1, 128, 2, 2, 2]]   [1, 128, 4, 4, 4]          0
    Conv3D-12      [[1, 128, 4, 4, 4]]    [1, 64, 4, 4, 4]       221,184
InstanceNorm3D-10  [[1, 64, 4, 4, 4]]     [1, 64, 4, 4, 4]         128
   LeakyReLU-8     [[1, 64, 4, 4, 4]]     [1, 64, 4, 4, 4]          0
    Conv3D-13      [[1, 64, 4, 4, 4]]     [1, 64, 4, 4, 4]        4,096
InstanceNorm3D-11  [[1, 64, 4, 4, 4]]     [1, 64, 4, 4, 4]         128
    Conv3D-14      [[1, 128, 4, 4, 4]]   [1, 128, 4, 4, 4]       442,368
InstanceNorm3D-12  [[1, 128, 4, 4, 4]]   [1, 128, 4, 4, 4]         256
   LeakyReLU-9     [[1, 128, 4, 4, 4]]   [1, 128, 4, 4, 4]          0
    Conv3D-15      [[1, 128, 4, 4, 4]]    [1, 64, 4, 4, 4]        8,192
InstanceNorm3D-13  [[1, 64, 4, 4, 4]]     [1, 64, 4, 4, 4]         128
  LeakyReLU-10     [[1, 64, 4, 4, 4]]     [1, 64, 4, 4, 4]          0
   Upsample-3      [[1, 64, 4, 4, 4]]     [1, 64, 8, 8, 8]          0
    Conv3D-16      [[1, 64, 8, 8, 8]]     [1, 32, 8, 8, 8]       55,296
InstanceNorm3D-14  [[1, 32, 8, 8, 8]]     [1, 32, 8, 8, 8]         64
  LeakyReLU-11     [[1, 32, 8, 8, 8]]     [1, 32, 8, 8, 8]          0
    Conv3D-17      [[1, 64, 8, 8, 8]]     [1, 64, 8, 8, 8]       110,592
InstanceNorm3D-15  [[1, 64, 8, 8, 8]]     [1, 64, 8, 8, 8]         128
  LeakyReLU-12     [[1, 64, 8, 8, 8]]     [1, 64, 8, 8, 8]          0
    Conv3D-18      [[1, 64, 8, 8, 8]]     [1, 32, 8, 8, 8]        2,048
InstanceNorm3D-16  [[1, 32, 8, 8, 8]]     [1, 32, 8, 8, 8]         64
  LeakyReLU-13     [[1, 32, 8, 8, 8]]     [1, 32, 8, 8, 8]          0
   Upsample-4      [[1, 32, 8, 8, 8]]   [1, 32, 16, 16, 16]         0
    Conv3D-19     [[1, 32, 16, 16, 16]] [1, 16, 16, 16, 16]      13,824
InstanceNorm3D-17 [[1, 16, 16, 16, 16]] [1, 16, 16, 16, 16]        32
  LeakyReLU-14    [[1, 16, 16, 16, 16]] [1, 16, 16, 16, 16]         0
    Conv3D-20     [[1, 32, 16, 16, 16]] [1, 32, 16, 16, 16]      27,648
InstanceNorm3D-18 [[1, 32, 16, 16, 16]] [1, 32, 16, 16, 16]        64
  LeakyReLU-15    [[1, 32, 16, 16, 16]] [1, 32, 16, 16, 16]         0
    Conv3D-21     [[1, 32, 16, 16, 16]] [1, 16, 16, 16, 16]        512
InstanceNorm3D-19 [[1, 16, 16, 16, 16]] [1, 16, 16, 16, 16]        32
  LeakyReLU-16    [[1, 16, 16, 16, 16]] [1, 16, 16, 16, 16]         0
   Upsample-5     [[1, 16, 16, 16, 16]] [1, 16, 32, 32, 32]         0
    Conv3D-22     [[1, 16, 32, 32, 32]]  [1, 8, 32, 32, 32]       3,456
InstanceNorm3D-20 [[1, 8, 32, 32, 32]]   [1, 8, 32, 32, 32]        16
  LeakyReLU-17    [[1, 8, 32, 32, 32]]   [1, 8, 32, 32, 32]         0
    Conv3D-23     [[1, 16, 32, 32, 32]] [1, 16, 32, 32, 32]       6,912
InstanceNorm3D-21 [[1, 16, 32, 32, 32]] [1, 16, 32, 32, 32]        32
  LeakyReLU-18    [[1, 16, 32, 32, 32]] [1, 16, 32, 32, 32]         0
    Conv3D-24     [[1, 16, 32, 32, 32]]  [1, 2, 32, 32, 32]        32
    Conv3D-25      [[1, 64, 8, 8, 8]]     [1, 2, 8, 8, 8]          128
   Upsample-1     [[1, 2, 16, 16, 16]]   [1, 2, 32, 32, 32]         0
    Conv3D-26     [[1, 32, 16, 16, 16]]  [1, 2, 16, 16, 16]        64
==============================================================================
Total params: 1,783,352
Trainable params: 1,783,352
Non-trainable params: 0
------------------------------------------------------------------------------
Input size (MB): 0.12
Forward/backward pass size (MB): 45.69
Params size (MB): 6.80
Estimated Total Size (MB): 52.62
------------------------------------------------------------------------------
