----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1        [-1, 8, 32, 32, 32]             216
         LeakyReLU-2        [-1, 8, 32, 32, 32]               0
            Conv3d-3        [-1, 8, 32, 32, 32]           1,728
         Dropout3d-4        [-1, 8, 32, 32, 32]               0
         LeakyReLU-5        [-1, 8, 32, 32, 32]               0
            Conv3d-6        [-1, 8, 32, 32, 32]           1,728
         LeakyReLU-7        [-1, 8, 32, 32, 32]               0
    InstanceNorm3d-8        [-1, 8, 32, 32, 32]               0
         LeakyReLU-9        [-1, 8, 32, 32, 32]               0
           Conv3d-10       [-1, 16, 16, 16, 16]           3,456
   InstanceNorm3d-11       [-1, 16, 16, 16, 16]               0
        LeakyReLU-12       [-1, 16, 16, 16, 16]               0
           Conv3d-13       [-1, 16, 16, 16, 16]           6,912
        Dropout3d-14       [-1, 16, 16, 16, 16]               0
   InstanceNorm3d-15       [-1, 16, 16, 16, 16]               0
        LeakyReLU-16       [-1, 16, 16, 16, 16]               0
           Conv3d-17       [-1, 16, 16, 16, 16]           6,912
   InstanceNorm3d-18       [-1, 16, 16, 16, 16]               0
        LeakyReLU-19       [-1, 16, 16, 16, 16]               0
           Conv3d-20          [-1, 32, 8, 8, 8]          13,824
   InstanceNorm3d-21          [-1, 32, 8, 8, 8]               0
        LeakyReLU-22          [-1, 32, 8, 8, 8]               0
           Conv3d-23          [-1, 32, 8, 8, 8]          27,648
        Dropout3d-24          [-1, 32, 8, 8, 8]               0
   InstanceNorm3d-25          [-1, 32, 8, 8, 8]               0
        LeakyReLU-26          [-1, 32, 8, 8, 8]               0
           Conv3d-27          [-1, 32, 8, 8, 8]          27,648
   InstanceNorm3d-28          [-1, 32, 8, 8, 8]               0
        LeakyReLU-29          [-1, 32, 8, 8, 8]               0
           Conv3d-30          [-1, 64, 4, 4, 4]          55,296
   InstanceNorm3d-31          [-1, 64, 4, 4, 4]               0
        LeakyReLU-32          [-1, 64, 4, 4, 4]               0
           Conv3d-33          [-1, 64, 4, 4, 4]         110,592
        Dropout3d-34          [-1, 64, 4, 4, 4]               0
   InstanceNorm3d-35          [-1, 64, 4, 4, 4]               0
        LeakyReLU-36          [-1, 64, 4, 4, 4]               0
           Conv3d-37          [-1, 64, 4, 4, 4]         110,592
   InstanceNorm3d-38          [-1, 64, 4, 4, 4]               0
        LeakyReLU-39          [-1, 64, 4, 4, 4]               0
           Conv3d-40         [-1, 128, 2, 2, 2]         221,184
   InstanceNorm3d-41         [-1, 128, 2, 2, 2]               0
        LeakyReLU-42         [-1, 128, 2, 2, 2]               0
           Conv3d-43         [-1, 128, 2, 2, 2]         442,368
        Dropout3d-44         [-1, 128, 2, 2, 2]               0
   InstanceNorm3d-45         [-1, 128, 2, 2, 2]               0
        LeakyReLU-46         [-1, 128, 2, 2, 2]               0
           Conv3d-47         [-1, 128, 2, 2, 2]         442,368
   InstanceNorm3d-48         [-1, 128, 2, 2, 2]               0
        LeakyReLU-49         [-1, 128, 2, 2, 2]               0
         Upsample-50         [-1, 128, 4, 4, 4]               0
           Conv3d-51          [-1, 64, 4, 4, 4]         221,184
   InstanceNorm3d-52          [-1, 64, 4, 4, 4]               0
        LeakyReLU-53          [-1, 64, 4, 4, 4]               0
           Conv3d-54          [-1, 64, 4, 4, 4]           4,096
   InstanceNorm3d-55          [-1, 64, 4, 4, 4]               0
        LeakyReLU-56          [-1, 64, 4, 4, 4]               0
           Conv3d-57         [-1, 128, 4, 4, 4]         442,368
   InstanceNorm3d-58         [-1, 128, 4, 4, 4]               0
        LeakyReLU-59         [-1, 128, 4, 4, 4]               0
           Conv3d-60          [-1, 64, 4, 4, 4]           8,192
   InstanceNorm3d-61          [-1, 64, 4, 4, 4]               0
        LeakyReLU-62          [-1, 64, 4, 4, 4]               0
         Upsample-63          [-1, 64, 8, 8, 8]               0
           Conv3d-64          [-1, 32, 8, 8, 8]          55,296
   InstanceNorm3d-65          [-1, 32, 8, 8, 8]               0
        LeakyReLU-66          [-1, 32, 8, 8, 8]               0
           Conv3d-67          [-1, 64, 8, 8, 8]         110,592
   InstanceNorm3d-68          [-1, 64, 8, 8, 8]               0
        LeakyReLU-69          [-1, 64, 8, 8, 8]               0
           Conv3d-70          [-1, 32, 8, 8, 8]           2,048
   InstanceNorm3d-71          [-1, 32, 8, 8, 8]               0
        LeakyReLU-72          [-1, 32, 8, 8, 8]               0
         Upsample-73       [-1, 32, 16, 16, 16]               0
           Conv3d-74       [-1, 16, 16, 16, 16]          13,824
   InstanceNorm3d-75       [-1, 16, 16, 16, 16]               0
        LeakyReLU-76       [-1, 16, 16, 16, 16]               0
           Conv3d-77       [-1, 32, 16, 16, 16]          27,648
   InstanceNorm3d-78       [-1, 32, 16, 16, 16]               0
        LeakyReLU-79       [-1, 32, 16, 16, 16]               0
           Conv3d-80       [-1, 16, 16, 16, 16]             512
   InstanceNorm3d-81       [-1, 16, 16, 16, 16]               0
        LeakyReLU-82       [-1, 16, 16, 16, 16]               0
         Upsample-83       [-1, 16, 32, 32, 32]               0
           Conv3d-84        [-1, 8, 32, 32, 32]           3,456
   InstanceNorm3d-85        [-1, 8, 32, 32, 32]               0
        LeakyReLU-86        [-1, 8, 32, 32, 32]               0
           Conv3d-87       [-1, 16, 32, 32, 32]           6,912
   InstanceNorm3d-88       [-1, 16, 32, 32, 32]               0
        LeakyReLU-89       [-1, 16, 32, 32, 32]               0
           Conv3d-90        [-1, 2, 32, 32, 32]              32
           Conv3d-91           [-1, 2, 8, 8, 8]             128
         Upsample-92        [-1, 2, 16, 16, 16]               0
           Conv3d-93        [-1, 2, 16, 16, 16]              64
         Upsample-94        [-1, 2, 32, 32, 32]               0
================================================================
Total params: 2,368,824
Trainable params: 2,368,824
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.12
Forward/backward pass size (MB): 57.05
Params size (MB): 9.04
Estimated Total Size (MB): 66.22
----------------------------------------------------------------
