----------------------------------------------------------------------------------------------------
   Layer (type)                   Input Shape                     Output Shape         Param #
====================================================================================================
     Conv3D-1                 [[1, 1, 32, 32, 32]]            [1, 16, 32, 32, 32]       2,016
  BatchNorm3D-1              [[1, 16, 32, 32, 32]]            [1, 16, 32, 32, 32]        64
      ELU-1                  [[1, 16, 32, 32, 32]]            [1, 16, 32, 32, 32]         0
InputTransition-1             [[1, 1, 32, 32, 32]]            [1, 16, 32, 32, 32]         0
     Conv3D-2                [[1, 16, 32, 32, 32]]            [1, 32, 16, 16, 16]       4,128
  BatchNorm3D-2              [[1, 32, 16, 16, 16]]            [1, 32, 16, 16, 16]        128
      ELU-2                  [[1, 32, 16, 16, 16]]            [1, 32, 16, 16, 16]         0
     Conv3D-3                [[1, 32, 16, 16, 16]]            [1, 32, 16, 16, 16]      128,032
  BatchNorm3D-3              [[1, 32, 16, 16, 16]]            [1, 32, 16, 16, 16]        128
      ELU-4                  [[1, 32, 16, 16, 16]]            [1, 32, 16, 16, 16]         0
     LUConv-1                [[1, 32, 16, 16, 16]]            [1, 32, 16, 16, 16]         0
      ELU-3                  [[1, 32, 16, 16, 16]]            [1, 32, 16, 16, 16]         0
 DownTransition-1            [[1, 16, 32, 32, 32]]            [1, 32, 16, 16, 16]         0
     Conv3D-4                [[1, 32, 16, 16, 16]]              [1, 64, 8, 8, 8]       16,448
  BatchNorm3D-4                [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]         256
      ELU-5                    [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]          0
     Conv3D-5                  [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]       512,064
  BatchNorm3D-5                [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]         256
      ELU-7                    [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]          0
     LUConv-2                  [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]          0
     Conv3D-6                  [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]       512,064
  BatchNorm3D-6                [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]         256
      ELU-8                    [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]          0
     LUConv-3                  [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]          0
      ELU-6                    [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]          0
 DownTransition-2            [[1, 32, 16, 16, 16]]              [1, 64, 8, 8, 8]          0
     Conv3D-7                  [[1, 64, 8, 8, 8]]              [1, 128, 4, 4, 4]       65,664
  BatchNorm3D-7               [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]         512
      ELU-9                   [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]          0
   Dropout3D-3                [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]          0
     Conv3D-8                 [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]      2,048,128
  BatchNorm3D-8               [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]         512
      ELU-11                  [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]          0
     LUConv-4                 [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]          0
     Conv3D-9                 [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]      2,048,128
  BatchNorm3D-9               [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]         512
      ELU-12                  [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]          0
     LUConv-5                 [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]          0
    Conv3D-10                 [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]      2,048,128
  BatchNorm3D-10              [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]         512
      ELU-13                  [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]          0
     LUConv-6                 [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]          0
      ELU-10                  [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]          0
 DownTransition-3              [[1, 64, 8, 8, 8]]              [1, 128, 4, 4, 4]          0
    Conv3D-11                 [[1, 128, 4, 4, 4]]              [1, 256, 2, 2, 2]       262,400
  BatchNorm3D-11              [[1, 256, 2, 2, 2]]              [1, 256, 2, 2, 2]        1,024
      ELU-14                  [[1, 256, 2, 2, 2]]              [1, 256, 2, 2, 2]          0
   Dropout3D-4                [[1, 256, 2, 2, 2]]              [1, 256, 2, 2, 2]          0
    Conv3D-12                 [[1, 256, 2, 2, 2]]              [1, 256, 2, 2, 2]      8,192,256
  BatchNorm3D-12              [[1, 256, 2, 2, 2]]              [1, 256, 2, 2, 2]        1,024
      ELU-16                  [[1, 256, 2, 2, 2]]              [1, 256, 2, 2, 2]          0
     LUConv-7                 [[1, 256, 2, 2, 2]]              [1, 256, 2, 2, 2]          0
    Conv3D-13                 [[1, 256, 2, 2, 2]]              [1, 256, 2, 2, 2]      8,192,256
  BatchNorm3D-13              [[1, 256, 2, 2, 2]]              [1, 256, 2, 2, 2]        1,024
      ELU-17                  [[1, 256, 2, 2, 2]]              [1, 256, 2, 2, 2]          0
     LUConv-8                 [[1, 256, 2, 2, 2]]              [1, 256, 2, 2, 2]          0
      ELU-15                  [[1, 256, 2, 2, 2]]              [1, 256, 2, 2, 2]          0
 DownTransition-4             [[1, 128, 4, 4, 4]]              [1, 256, 2, 2, 2]          0
   Dropout3D-5                [[1, 256, 2, 2, 2]]              [1, 256, 2, 2, 2]          0
   Dropout3D-6                [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]          0
Conv3DTranspose-1             [[1, 256, 2, 2, 2]]              [1, 128, 4, 4, 4]       262,272
  BatchNorm3D-14              [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]         512
      ELU-18                  [[1, 128, 4, 4, 4]]              [1, 128, 4, 4, 4]          0
    Conv3D-14                 [[1, 256, 4, 4, 4]]              [1, 256, 4, 4, 4]      8,192,256
  BatchNorm3D-15              [[1, 256, 4, 4, 4]]              [1, 256, 4, 4, 4]        1,024
      ELU-20                  [[1, 256, 4, 4, 4]]              [1, 256, 4, 4, 4]          0
     LUConv-9                 [[1, 256, 4, 4, 4]]              [1, 256, 4, 4, 4]          0
    Conv3D-15                 [[1, 256, 4, 4, 4]]              [1, 256, 4, 4, 4]      8,192,256
  BatchNorm3D-16              [[1, 256, 4, 4, 4]]              [1, 256, 4, 4, 4]        1,024
      ELU-21                  [[1, 256, 4, 4, 4]]              [1, 256, 4, 4, 4]          0
    LUConv-10                 [[1, 256, 4, 4, 4]]              [1, 256, 4, 4, 4]          0
      ELU-19                  [[1, 256, 4, 4, 4]]              [1, 256, 4, 4, 4]          0
  UpTransition-1     [[1, 256, 2, 2, 2], [1, 128, 4, 4, 4]]    [1, 256, 4, 4, 4]          0
   Dropout3D-7                [[1, 256, 4, 4, 4]]              [1, 256, 4, 4, 4]          0
   Dropout3D-8                 [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]          0
Conv3DTranspose-2             [[1, 256, 4, 4, 4]]               [1, 64, 8, 8, 8]       131,136
  BatchNorm3D-17               [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]         256
      ELU-22                   [[1, 64, 8, 8, 8]]               [1, 64, 8, 8, 8]          0
    Conv3D-16                 [[1, 128, 8, 8, 8]]              [1, 128, 8, 8, 8]      2,048,128
  BatchNorm3D-18              [[1, 128, 8, 8, 8]]              [1, 128, 8, 8, 8]         512
      ELU-24                  [[1, 128, 8, 8, 8]]              [1, 128, 8, 8, 8]          0
    LUConv-11                 [[1, 128, 8, 8, 8]]              [1, 128, 8, 8, 8]          0
    Conv3D-17                 [[1, 128, 8, 8, 8]]              [1, 128, 8, 8, 8]      2,048,128
  BatchNorm3D-19              [[1, 128, 8, 8, 8]]              [1, 128, 8, 8, 8]         512
      ELU-25                  [[1, 128, 8, 8, 8]]              [1, 128, 8, 8, 8]          0
    LUConv-12                 [[1, 128, 8, 8, 8]]              [1, 128, 8, 8, 8]          0
      ELU-23                  [[1, 128, 8, 8, 8]]              [1, 128, 8, 8, 8]          0
  UpTransition-2     [[1, 256, 4, 4, 4], [1, 64, 8, 8, 8]]     [1, 128, 8, 8, 8]          0
   Dropout3D-10              [[1, 32, 16, 16, 16]]            [1, 32, 16, 16, 16]         0
Conv3DTranspose-3             [[1, 128, 8, 8, 8]]             [1, 32, 16, 16, 16]      32,800
  BatchNorm3D-20             [[1, 32, 16, 16, 16]]            [1, 32, 16, 16, 16]        128
      ELU-26                 [[1, 32, 16, 16, 16]]            [1, 32, 16, 16, 16]         0
    Conv3D-18                [[1, 64, 16, 16, 16]]            [1, 64, 16, 16, 16]      512,064
  BatchNorm3D-21             [[1, 64, 16, 16, 16]]            [1, 64, 16, 16, 16]        256
      ELU-28                 [[1, 64, 16, 16, 16]]            [1, 64, 16, 16, 16]         0
    LUConv-13                [[1, 64, 16, 16, 16]]            [1, 64, 16, 16, 16]         0
      ELU-27                 [[1, 64, 16, 16, 16]]            [1, 64, 16, 16, 16]         0
  UpTransition-3    [[1, 128, 8, 8, 8], [1, 32, 16, 16, 16]]  [1, 64, 16, 16, 16]         0
   Dropout3D-12              [[1, 16, 32, 32, 32]]            [1, 16, 32, 32, 32]         0
Conv3DTranspose-4            [[1, 64, 16, 16, 16]]            [1, 16, 32, 32, 32]       8,208
  BatchNorm3D-22             [[1, 16, 32, 32, 32]]            [1, 16, 32, 32, 32]        64
      ELU-29                 [[1, 16, 32, 32, 32]]            [1, 16, 32, 32, 32]         0
    Conv3D-19                [[1, 32, 32, 32, 32]]            [1, 32, 32, 32, 32]      128,032
  BatchNorm3D-23             [[1, 32, 32, 32, 32]]            [1, 32, 32, 32, 32]        128
      ELU-31                 [[1, 32, 32, 32, 32]]            [1, 32, 32, 32, 32]         0
    LUConv-14                [[1, 32, 32, 32, 32]]            [1, 32, 32, 32, 32]         0
      ELU-30                 [[1, 32, 32, 32, 32]]            [1, 32, 32, 32, 32]         0
  UpTransition-4   [[1, 64, 16, 16, 16], [1, 16, 32, 32, 32]] [1, 32, 32, 32, 32]         0
    Conv3D-20                [[1, 32, 32, 32, 32]]             [1, 2, 32, 32, 32]       8,002
  BatchNorm3D-24              [[1, 2, 32, 32, 32]]             [1, 2, 32, 32, 32]         8
      ELU-32                  [[1, 2, 32, 32, 32]]             [1, 2, 32, 32, 32]         0
    Conv3D-21                 [[1, 2, 32, 32, 32]]             [1, 2, 32, 32, 32]         6
OutputTransition-1           [[1, 32, 32, 32, 32]]             [1, 2, 32, 32, 32]         0
====================================================================================================
Total params: 45,605,632
Trainable params: 45,595,000
Non-trainable params: 10,632
----------------------------------------------------------------------------------------------------
Input size (MB): 0.12
Forward/backward pass size (MB): 119.73
Params size (MB): 173.97
Estimated Total Size (MB): 293.83
----------------------------------------------------------------------------------------------------
Vnet test is complete
