----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1       [-1, 16, 32, 32, 32]           2,016
       BatchNorm3d-2       [-1, 16, 32, 32, 32]              32
               ELU-3       [-1, 16, 32, 32, 32]               0
   InputTransition-4       [-1, 16, 32, 32, 32]               0
            Conv3d-5       [-1, 32, 16, 16, 16]           4,128
       BatchNorm3d-6       [-1, 32, 16, 16, 16]              64
               ELU-7       [-1, 32, 16, 16, 16]               0
            Conv3d-8       [-1, 32, 16, 16, 16]         128,032
       BatchNorm3d-9       [-1, 32, 16, 16, 16]              64
              ELU-10       [-1, 32, 16, 16, 16]               0
           LUConv-11       [-1, 32, 16, 16, 16]               0
              ELU-12       [-1, 32, 16, 16, 16]               0
   DownTransition-13       [-1, 32, 16, 16, 16]               0
           Conv3d-14          [-1, 64, 8, 8, 8]          16,448
      BatchNorm3d-15          [-1, 64, 8, 8, 8]             128
              ELU-16          [-1, 64, 8, 8, 8]               0
           Conv3d-17          [-1, 64, 8, 8, 8]         512,064
      BatchNorm3d-18          [-1, 64, 8, 8, 8]             128
              ELU-19          [-1, 64, 8, 8, 8]               0
           LUConv-20          [-1, 64, 8, 8, 8]               0
           Conv3d-21          [-1, 64, 8, 8, 8]         512,064
      BatchNorm3d-22          [-1, 64, 8, 8, 8]             128
              ELU-23          [-1, 64, 8, 8, 8]               0
           LUConv-24          [-1, 64, 8, 8, 8]               0
              ELU-25          [-1, 64, 8, 8, 8]               0
   DownTransition-26          [-1, 64, 8, 8, 8]               0
           Conv3d-27         [-1, 128, 4, 4, 4]          65,664
      BatchNorm3d-28         [-1, 128, 4, 4, 4]             256
              ELU-29         [-1, 128, 4, 4, 4]               0
        Dropout3d-30         [-1, 128, 4, 4, 4]               0
           Conv3d-31         [-1, 128, 4, 4, 4]       2,048,128
      BatchNorm3d-32         [-1, 128, 4, 4, 4]             256
              ELU-33         [-1, 128, 4, 4, 4]               0
           LUConv-34         [-1, 128, 4, 4, 4]               0
           Conv3d-35         [-1, 128, 4, 4, 4]       2,048,128
      BatchNorm3d-36         [-1, 128, 4, 4, 4]             256
              ELU-37         [-1, 128, 4, 4, 4]               0
           LUConv-38         [-1, 128, 4, 4, 4]               0
           Conv3d-39         [-1, 128, 4, 4, 4]       2,048,128
      BatchNorm3d-40         [-1, 128, 4, 4, 4]             256
              ELU-41         [-1, 128, 4, 4, 4]               0
           LUConv-42         [-1, 128, 4, 4, 4]               0
              ELU-43         [-1, 128, 4, 4, 4]               0
   DownTransition-44         [-1, 128, 4, 4, 4]               0
           Conv3d-45         [-1, 256, 2, 2, 2]         262,400
      BatchNorm3d-46         [-1, 256, 2, 2, 2]             512
              ELU-47         [-1, 256, 2, 2, 2]               0
        Dropout3d-48         [-1, 256, 2, 2, 2]               0
           Conv3d-49         [-1, 256, 2, 2, 2]       8,192,256
      BatchNorm3d-50         [-1, 256, 2, 2, 2]             512
              ELU-51         [-1, 256, 2, 2, 2]               0
           LUConv-52         [-1, 256, 2, 2, 2]               0
           Conv3d-53         [-1, 256, 2, 2, 2]       8,192,256
      BatchNorm3d-54         [-1, 256, 2, 2, 2]             512
              ELU-55         [-1, 256, 2, 2, 2]               0
           LUConv-56         [-1, 256, 2, 2, 2]               0
              ELU-57         [-1, 256, 2, 2, 2]               0
   DownTransition-58         [-1, 256, 2, 2, 2]               0
        Dropout3d-59         [-1, 256, 2, 2, 2]               0
        Dropout3d-60         [-1, 128, 4, 4, 4]               0
  ConvTranspose3d-61         [-1, 128, 4, 4, 4]         262,272
      BatchNorm3d-62         [-1, 128, 4, 4, 4]             256
              ELU-63         [-1, 128, 4, 4, 4]               0
           Conv3d-64         [-1, 256, 4, 4, 4]       8,192,256
      BatchNorm3d-65         [-1, 256, 4, 4, 4]             512
              ELU-66         [-1, 256, 4, 4, 4]               0
           LUConv-67         [-1, 256, 4, 4, 4]               0
           Conv3d-68         [-1, 256, 4, 4, 4]       8,192,256
      BatchNorm3d-69         [-1, 256, 4, 4, 4]             512
              ELU-70         [-1, 256, 4, 4, 4]               0
           LUConv-71         [-1, 256, 4, 4, 4]               0
              ELU-72         [-1, 256, 4, 4, 4]               0
     UpTransition-73         [-1, 256, 4, 4, 4]               0
        Dropout3d-74         [-1, 256, 4, 4, 4]               0
        Dropout3d-75          [-1, 64, 8, 8, 8]               0
  ConvTranspose3d-76          [-1, 64, 8, 8, 8]         131,136
      BatchNorm3d-77          [-1, 64, 8, 8, 8]             128
              ELU-78          [-1, 64, 8, 8, 8]               0
           Conv3d-79         [-1, 128, 8, 8, 8]       2,048,128
      BatchNorm3d-80         [-1, 128, 8, 8, 8]             256
              ELU-81         [-1, 128, 8, 8, 8]               0
           LUConv-82         [-1, 128, 8, 8, 8]               0
           Conv3d-83         [-1, 128, 8, 8, 8]       2,048,128
      BatchNorm3d-84         [-1, 128, 8, 8, 8]             256
              ELU-85         [-1, 128, 8, 8, 8]               0
           LUConv-86         [-1, 128, 8, 8, 8]               0
              ELU-87         [-1, 128, 8, 8, 8]               0
     UpTransition-88         [-1, 128, 8, 8, 8]               0
        Dropout3d-89       [-1, 32, 16, 16, 16]               0
  ConvTranspose3d-90       [-1, 32, 16, 16, 16]          32,800
      BatchNorm3d-91       [-1, 32, 16, 16, 16]              64
              ELU-92       [-1, 32, 16, 16, 16]               0
           Conv3d-93       [-1, 64, 16, 16, 16]         512,064
      BatchNorm3d-94       [-1, 64, 16, 16, 16]             128
              ELU-95       [-1, 64, 16, 16, 16]               0
           LUConv-96       [-1, 64, 16, 16, 16]               0
              ELU-97       [-1, 64, 16, 16, 16]               0
     UpTransition-98       [-1, 64, 16, 16, 16]               0
        Dropout3d-99       [-1, 16, 32, 32, 32]               0
 ConvTranspose3d-100       [-1, 16, 32, 32, 32]           8,208
     BatchNorm3d-101       [-1, 16, 32, 32, 32]              32
             ELU-102       [-1, 16, 32, 32, 32]               0
          Conv3d-103       [-1, 32, 32, 32, 32]         128,032
     BatchNorm3d-104       [-1, 32, 32, 32, 32]              64
             ELU-105       [-1, 32, 32, 32, 32]               0
          LUConv-106       [-1, 32, 32, 32, 32]               0
             ELU-107       [-1, 32, 32, 32, 32]               0
    UpTransition-108       [-1, 32, 32, 32, 32]               0
          Conv3d-109        [-1, 2, 32, 32, 32]           8,002
     BatchNorm3d-110        [-1, 2, 32, 32, 32]               4
             ELU-111        [-1, 2, 32, 32, 32]               0
          Conv3d-112        [-1, 2, 32, 32, 32]               6
OutputTransition-113        [-1, 2, 32, 32, 32]               0
================================================================
Total params: 45,600,316
Trainable params: 45,600,316
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.12
Forward/backward pass size (MB): 119.73
Params size (MB): 173.95
Estimated Total Size (MB): 293.81
----------------------------------------------------------------
Vnet test is complete
